nxp-mcuxpresso/mcuxsdk-examples/_boards/kw45b41zloc/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLEDsPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioC);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t LED1_R1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC0 (pin 37)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_LED1_R1_GPIO, BOARD_INITLEDSPINS_LED1_R1_PIN, &LED1_R1_config);

    gpio_pin_config_t LED2_Y2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC6 (pin 44)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_LED2_Y2_GPIO, BOARD_INITLEDSPINS_LED2_Y2_PIN, &LED2_Y2_config);

    const port_pin_config_t LED1_R1 = {/* Internal pull-up/down resistor is disabled */
                                       .pullSelect = (uint16_t)kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       .slewRate = (uint16_t)kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                       .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                       /* Pin is configured as PTC0 */
                                       .mux = (uint16_t)kPORT_MuxAsGpio,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTC0 (pin 37) is configured as PTC0 */
    PORT_SetPinConfig(BOARD_INITLEDSPINS_LED1_R1_PORT, BOARD_INITLEDSPINS_LED1_R1_PIN, &LED1_R1);

    const port_pin_config_t LED2_Y2 = {/* Internal pull-up/down resistor is disabled */
                                       .pullSelect = (uint16_t)kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       .slewRate = (uint16_t)kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                       .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                       /* Pin is configured as PTC6 */
                                       .mux = (uint16_t)kPORT_MuxAsGpio,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTC6 (pin 44) is configured as PTC6 */
    PORT_SetPinConfig(BOARD_INITLEDSPINS_LED2_Y2_PORT, BOARD_INITLEDSPINS_LED2_Y2_PIN, &LED2_Y2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '39', peripheral: LPUART1, signal: RX, pin_signal: PTC2/WUU0_P9/LPSPI1_SOUT/LPUART1_RX/LPI2C1_SCLS/TPM1_CH2/I3C0_PUR/FLEXIO0_D18, pull_select: down,
    pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low}
  - {pin_num: '40', peripheral: LPUART1, signal: TX, pin_signal: PTC3/LPSPI1_SCK/LPUART1_TX/LPI2C1_SDAS/TPM1_CH3/FLEXIO0_D19, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    const port_pin_config_t DEBUG_UART_RX = {/* Internal pull-up/down resistor is disabled */
                                             .pullSelect = (uint16_t)kPORT_PullDisable,
                                             /* Low internal pull resistor value is selected. */
                                             .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                             /* Fast slew rate is configured */
                                             .slewRate = (uint16_t)kPORT_FastSlewRate,
                                             /* Passive input filter is disabled */
                                             .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                             /* Open drain output is disabled */
                                             .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                             /* Low drive strength is configured */
                                             .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                             /* Normal drive strength is configured */
                                             .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                             /* Pin is configured as LPUART1_RX */
                                             .mux = (uint16_t)kPORT_MuxAlt3,
                                             /* Pin Control Register fields [15:0] are not locked */
                                             .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTC2 (pin 39) is configured as LPUART1_RX */
    PORT_SetPinConfig(BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN, &DEBUG_UART_RX);

